<template>
    <div>
        <div class="crumbs">
            <el-breadcrumb separator="/">
                <el-breadcrumb-item><i class="el-icon-lx-favor"></i> 关于我们</el-breadcrumb-item>
            </el-breadcrumb>
        </div>
        <div class="container">

            <el-container>
                <el-main>
                    <el-collapse v-model="activeNames" @change="handleChange">
                        <div><img src="http://ssdut.dlut.edu.cn/shijianjidi/chuangxinzx/images/ny01.jpg" width='100%'> </div>
                        <el-collapse-item title="实训中心简介" name="1" style="font-size:30px">
                            <div style="font-size:18px">学院现与政府、企业建有大工-IBM、大工-微软、大工-瑞萨、大工-用友等6个软件人才实训基地。拥有标准工位200余个。基地聘请业界知名企业家、高级工程师和管理人员为学院兼职教师，引进IBM，微软等国际知名企业的管理模式和教学案例，使学生能从企业文化、业务理解、需求分析、设计编码、产品监控、测试验收等全面熟悉软件开发流程，掌握一个成熟项目的开发规范。完成学员从学生到员工的角色转换，增强学生的就业市场竞争力，累计完成1000多人的实训教学,为行业提供了大量的实用型中高端软件人才，深受行业好评。

                                同时，学院和IBM、花旗金融信息、上海华钦等多家公司共建大型主机卓越人才培养专业方向；与用友软等件联合开设ERP班；与腾讯等合作开办的“大工-腾讯移动互联网班”。不断丰富并扩充校企合作的内涵和学生能力培养的载体。实现人才培养与产业的无缝链接，营造健康的软件人才培养生态链。该教学模式也获得大连理工大学优秀教学成果奖一等奖和届辽宁省高等学校教育教学成果奖二等奖。</div>
                        </el-collapse-item>
                        <el-collapse-item title="教学理念" name="2">
                            <div align="center"><img src="http://ssdut.dlut.edu.cn/__local/2/A5/C1/3660221FF594F1DAD972AB114EC_9DA36F37_9EE0.jpg"/></div>
                            <div style="font-size:18px">2007年5月27日，大连理工大学—IBM软件人才实训基地和大连软件人才（大工）实训基地揭牌。2008年，“大连理工大学——微软创新中心”、大连理工大学-瑞萨嵌入式实训基地揭牌，2010年9月11日，大连理工大学校长欧进萍与用友软件董事长王文京签署了共建“大工—用友创新创业实践基地”协议。基地获批大连市软件人才实训基地、辽宁省服务外包人才实训基地称号。

                                基地建设主要是为了强化学生的工程实践能力，弥补传统教育中“重理论、轻实践”以及实践动手能力不足的缺憾，为学生创造职场工作的真实模拟环境。因此，学院与政府、企业合作，在学校成立“模拟公司”，即共建大连理工大学软件人才实训基地。政府给予一定的政策和资金支持，企业选派项目经理、技术总监、有经验的软件工程师为指导团队，对学生进行实际项目培训。学校负责基地的组织、协调与管理，并对学生进行相应的辅导。

                                基地秉承“为学生提供人本增值服务”的教育理念，在全球范围内整合IBM、微软、瑞萨、用友等国际知名TI企业合作伙伴的IT教育资源，采用公司化的管理模式，依托大连理工大学的人才、师资优势，引进IBM，微软等国际知名企业的管理模式和教学案例，使学生真切体验企业文化氛围和工作环境，感受公司对员工知识结构、技术能力、团队合作的要求，同时也能从企业文化、业务理解、需求分析、设计编码、产品监控、测试验收等全面熟悉软件开发流程，掌握一个成熟项目的开发规范。完成学员从学生到员工的角色转换，增强学生的就业市场竞争力，为学生提供了一个全方位武装自己的平台。</div>
                            <div align="center"><img src="http://ssdut.dlut.edu.cn/__local/6/A8/5B/CECA6C830D53B0AE768E2939968_5D2D8C93_6E99.png"/></div>
                            <div style="font-size:18px">2010年6月23日，教育部推出  “卓越工程师教育培养计划”，以培养创新能力强、适应经济社会发展需要的高质量各类型工程技术人才。学院基于良好的校企合作背景与基础，需遵循“行业指导、校企合作、分类实施、形式多样”的原则。不断探索校企联合工程教育的培养模式、教学模式、实践教学和评价体系等新思路，推动产学研的全面合作，与企业合作，联合开设了形式多样的卓越人才培养班。和IBM、花旗软件、上海华钦等多家公司共建大型主机卓越人才培养专业方向，与用友软件联合开设ERP专业方向，培养具有一定ERP理论基础、ERP系统实施和二次开发能力的ERP系统实施及二次开发工程师。随着移动互联网的兴起，2012年学院和腾讯合作开办的“大工-腾讯移动互联网卓越班”。

                                自此，学院建立了IBM大型主机卓越班，用友 ERP卓越班和腾讯卓越班，以《卓越软件工程师实践教学体系建设》为题的教学改革项目，得到了2012年度辽宁省普通高等教育本科教学改革研究项目的支持，并获得了大连理工大学优秀教学成果二等奖，全面开启软件学院校企联合卓越人才培养的新篇章，丰富并扩充了校企合作的内涵和学生能力培养的载体。实现人才培养与产业的无缝链接，营造健康的软件人才培养生态链。大型主机，ERP，移动互联网特色班共计培养了500多名学生，在行业中形成了良好的知名度。</div>
                        </el-collapse-item>
                        <el-collapse-item title="科研成果" name="3">
                            <div style="font-size:18px">创新实践基地工作内涵包括高端软件人才实训基地、大学生创新实践中心，创业孵化基地及学院网络中心,是软件学院创新实践人才培养的重要平台，同时也是学院校企合作的主要窗口。拥有专职教师10人，企业兼职教师30余人。多次获得辽宁省教育教学成果奖、大连理工大学优秀教学成果奖、教育部-IBM精品课程等多种荣誉与成果。李凤岐老师获2014年全国高等学校创业教育工作先进个人，学生创新团队获得团中央学校部和中国青少年发展基金会联合颁发的小平科技创新团队称号，获得国家级及以上竞赛奖项1000余人次。</div>
                        </el-collapse-item>
                    </el-collapse>
                </el-main>
            </el-container>

        </div>
    </div>
</template>

<script>
    export default {
        name: "about",
        data() {
            return {
                activeNames: ['1']
            };
        },
        methods: {
            handleChange(val) {
                console.log(val);
            }
        }
    }
</script>

<style scoped>

</style>
